[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:93:55
                             id="requester"
                             type="text"
                             isInvalid={Boolean(errors.requester)}
-                            {...register("requester", {
-                                required: "Requester Name is required."
-                            })}
+                            {...register("requester", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Requester Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
