[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:48:21
             accessor: 'requestDateTime',
         },
         {
-            Header: 'Body',
+            Header: "",
             accessor: 'requestBody',
         }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Body. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:49:23
         },
         {
             Header: 'Body',
-            accessor: 'requestBody',
+            accessor: "",
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestBody"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
