[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:32:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="HelpRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                            <Form.Control.Feedback type="invalid">
-                                {errors.id?.message}
-                            </Form.Control.Feedback>
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:32:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="HelpRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                            <Form.Control.Feedback type="invalid">
-                                {errors.id?.message}
-                            </Form.Control.Feedback>
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="HelpRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                            <Form.Control.Feedback type="invalid">
+                                {errors.id?.message}
+                            </Form.Control.Feedback>
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:45:34
                                 disabled
                             />
                             <Form.Control.Feedback type="invalid">
-                                {errors.id?.message}
+                                {errors.id.message}
                             </Form.Control.Feedback>
                         </Form.Group>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:59:63
                             id="title"
                             type="text"
                             isInvalid={Boolean(errors.title)}
-                            {...register("title", { required: "Title is required."})}
+                            {...register("title", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:77:73
                             id="requestDateTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestDateTime)}
-                            {...register("requestDateTime", { required: true, pattern: isodate_regex })}
+                            {...register("requestDateTime", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:77:61
                             id="requestDateTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestDateTime)}
-                            {...register("requestDateTime", { required: true, pattern: isodate_regex })}
+                            {...register("requestDateTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:80:30
                             {...register("requestDateTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestDateTime && 'RequestDateTime is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /RequestDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:80:30
                             {...register("requestDateTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestDateTime && 'RequestDateTime is required.'}
+                            {errors.requestDateTime || 'RequestDateTime is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:100:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requester?.message}
+                            {errors.requester.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:115:30
                             {...register("requestBody")}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestBody?.message}
+                            {errors.requestBody.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
