[Killed] BlockStatement
main/pages/RecomendationRequest/RecomendationRequestCreatePage.js:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecomendationRequestCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecomendationRequestCreatePage() {}
 
killedBy: RecomendationRequestCreatePage tests Renders expected content
statusReason: Error: RecomendationRequestCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
