[Killed] BlockStatement
main/pages/RecomendationRequest/RecomendationRequestEditPage.js:3:56
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecomendationRequestEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecomendationRequestEditPage() {}
 
killedBy: RecomendationRequestEditPage tests Renders expected content
statusReason: Error: RecomendationRequestEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
