[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:55:43
                     id="email"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("email", {
-                        required: "Your email is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
-                    })}
+                    {...register("email", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Your email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:57:37
                     isInvalid={Boolean(errors.name)}
                     {...register("email", {
                         required: "Your email is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 100 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:77:37
                     isInvalid={Boolean(errors.professorEmail)}
                     {...register("professorEmail", {
                         required: "Professor Email is required.",
-                        maxLength : {
-                            value: 200,
-                            message: "Max length 200 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 200 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:79:38
                         required: "Professor Email is required.",
                         maxLength : {
                             value: 200,
-                            message: "Max length 200 characters"
+                            message: ""
                         }
                     })}
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 200 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:95:49
                     id="explanation"
                     type="text"
                     isInvalid={Boolean(errors.explanation)}
-                    {...register("explanation", {
-                        required: "Explanation is required.",
-                        maxLength : {
-                            value: 1000,
-                            message: "Max length 1000 characters"
-                        }
-                    })}
+                    {...register("explanation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:97:37
                     isInvalid={Boolean(errors.explanation)}
                     {...register("explanation", {
                         required: "Explanation is required.",
-                        maxLength : {
-                            value: 1000,
-                            message: "Max length 1000 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 1000 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
